anachrocomputer/STM32Blinky/BlackPill/blinky.c
/* initPWM --- set up PWM channels */

static void initPWM(void)
{
   // Configure Reset and Clock Control
   RCC->APB1ENR |= RCC_APB1ENR_TIM3EN;                    // Enable clock to TIM3 peripheral on APB1 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;                   // Enable clock to GPIO A peripherals on AHB1 bus
   RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;                   // Enable clock to GPIO B peripherals on AHB1 bus
   
   // Configure PA6, the GPIO pin with alternative function T3C1
   GPIOA->MODER |= GPIO_MODER_MODER6_1;        // PA6 in Alternative Function mode
   GPIOA->AFR[0] |= 2 << 24;                   // Configure PA6 as alternate function, AF2, TIM3
   
   // Configure PA7, the GPIO pin with alternative function T3C2
   GPIOA->MODER |= GPIO_MODER_MODER7_1;        // PA7 in Alternative Function mode
   GPIOA->AFR[0] |= 2 << 28;                   // Configure PA7 as alternate function, AF2, TIM3
   
   // Configure PB0, the GPIO pin with alternative function T3C3
   GPIOB->MODER |= GPIO_MODER_MODER0_1;        // PB0 in Alternative Function mode
   GPIOB->AFR[0] |= 2 << 0;                    // Configure PB0 as alternate function, AF2, TIM3
   
   // Don't configure PB1, the GPIO pin with alternative function T3C4, not needed
   
   // Configure Timer 3 for triple PWM generation
   TIM3->CCMR1 =  TIM_CCMR1_OC1PE | TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1; // Timer output compare mode PWM for T3C1
   TIM3->CCMR1 |= TIM_CCMR1_OC2PE | TIM_CCMR1_OC2M_2 | TIM_CCMR1_OC2M_1; // Timer output compare mode PWM for T3C2
   TIM3->CCMR2 |= TIM_CCMR2_OC3PE | TIM_CCMR2_OC3M_2 | TIM_CCMR2_OC3M_1; // Timer output compare mode PWM for T3C3
   TIM3->CR1 |= TIM_CR1_CEN | TIM_CR1_ARPE; // Enable counter, auto-reload to 0 at the end of a count
   TIM3->ARR = 0xFF;              // Auto-Reload Register: count to 255 (no point counting higher)
   TIM3->CCR1 = 0;                // Set T3C1 PWM to zero (0% duty cycle)
   TIM3->CCR2 = 0;                // Set T3C2 PWM to zero (0% duty cycle)
   TIM3->CCR3 = 0;                // Set T3C3 PWM to zero (0% duty cycle)
   TIM3->EGR |= TIM_EGR_UG;       // Event Generation Register: update generation ON
   TIM3->CCER |= TIM_CCER_CC1E;   // Output T3C1 enabled
   TIM3->CCER |= TIM_CCER_CC2E;   // Output T3C2 enabled
   TIM3->CCER |= TIM_CCER_CC3E;   // Output T3C3 enabled
}


/* initMillisecondTimer --- set up a timer to interrupt every millisecond */

static void initMillisecondTimer(void)
{
   // Set up timer for regular 1ms interrupt
   if (SysTick_Config(100000)) { // 100MHz divided by 1000  (SystemCoreClock / 1000)
      while (1)
         ;
   }
}


/* initWatchdog --- set up the watchdog timer */

static void initWatchdog(void)
{
   IWDG->KR = (uint16_t)0x5555;
   IWDG->PR = IWDG_PR_PR_2;      // Prescaler divide-by-64 gives 8 seconds
   IWDG->KR = (uint16_t)0xAAAA;
   
   IWDG->KR = (uint16_t)0xCCCC;  // Start the watchdog
}


int main(void)
{
   int ledState = 0;
   uint8_t fade = 0;
   uint32_t end;
   uint8_t flag = 0;
   
   initMCU();
   initGPIOs();
   initUARTs();
   initPWM();
   initMillisecondTimer();
   initWatchdog();
   
   __enable_irq();   // Enable all interrupts

   printf("\nHello from the STM%dF%d\n", 32, 411);
   
   printResetReason();
   printDeviceID();
   printSerialNumber();
   
   end = millis() + 500u;
   
   while (1) {
      if (Tick) {
         if (fade == 255) {
            fade = 0;

            if (ledState == 5)
               ledState = 0;
            else
               ledState++;
         }
         else
            fade++;
            
         setRGBLed(ledState, fade);
         
         if (millis() >= end) {
            end = millis() + 500u;
            
            if (flag) {
               GPIOC->BSRR = GPIO_BSRR_BR13; // GPIO pin PC13 LOW, LED on
            }
            else {
               GPIOC->BSRR = GPIO_BSRR_BS13; // GPIO pin PC13 HIGH, LED off
            }
            
            flag = !flag;
            
            UART2TxByte('U');
            UART2TxByte('2');
            UART2TxByte(' ');
            UART2TxByte('S');
            UART2TxByte('T');
            UART2TxByte('M');
            UART2TxByte('3');
            UART2TxByte('2');
            UART2TxByte(' ');
            
            UART6TxByte('U');
            UART6TxByte('6');
            UART6TxByte(' ');
            UART6TxByte('S');
            UART6TxByte('T');
            UART6TxByte('M');
            UART6TxByte('3');
            UART6TxByte('2');
            UART6TxByte(' ');
            
            printf("millis() = %ld\n", millis());
         }
         
         nudgeWatchdog();
         Tick = 0;
      }
      
      if (UART1RxAvailable()) {
         const uint8_t ch = UART1RxByte();
         
         printf("UART1: %02x\n", ch);
         switch (ch) {
         case 'i':
         case 'I':
            printDeviceID();
            break;
         case 'n':
         case 'N':
            printSerialNumber();
            break;
         case 'r':
         case 'R':
            printResetReason();
            break;
         case 's':
         case 'S':
            softwareReset();
            break;
         case 'w':
         case 'W':
            testWatchdog();
            break;
         }
      }
   }
}

